// Написать программу, которая будет выдавать название дня недели по заданному номеру.

Console.WriteLine("Hello, World!");
